W6D4/art_share_api/app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 5], ["artwork_id", 1], ["body", "here is a body for this comment"], ["created_at", "2020-10-29 21:43:45.235281"], ["updated_at", "2020-10-29 21:43:45.235281"]]
---
  def create
    comment = Comment.new(new_params)
    if comment.save