W6D4/art_share_api/app/controllers/users_controller.rb

  def index
    if params.include?(:user)
        user = User.where('username LIKE ?', "%#{new_params[:username]}%")
        render json: user
    else
        render json: User.all
---
SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE (username LIKE '')
SELECT "users".* FROM "users" WHERE (username LIKE 'user1')

  def create
    user = User.new(new_params)
    if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "asianguy69"], ["email", "email@email.com"], ["created_at", "2020-10-28 21:47:54.392479"], ["updated_at", "2020-10-28 21:47:54.392479"]]

  def show
    render json: User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    user = User.find_by(id: params[:id])
    if user.update(new_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "walker"], ["updated_at", "2020-10-28 21:56:55.490951"], ["id", 2]]

  def destroy
    user = User.find_by(id: params[:id])
    user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]