W6D3/first_routes_and_controllers/app/controllers/artworks_controller.rb

  def index
    # render json: Artwork.all
    artwork = Artwork.find_by(artist_id: params[:user_id])
    artwork_share = ArtworkShare.find_by(viewer_id: params[:user_id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 LIMIT $2  [["artist_id", 4], ["LIMIT", 1]]
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."viewer_id" = $1 LIMIT $2  [["viewer_id", 4], ["LIMIT", 1]]

  def create
    artwork = Artwork.new(new_params)
    if artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "\"Mona Lisa\""], ["image_url", "google.com/mona_lisa"], ["artist_id", 7], ["created_at", "2020-10-28 23:18:38.445404"], ["updated_at", "2020-10-28 23:18:38.445404"]]

  def show
    render json: Artwork.find_by(id: params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]