W6D3/first_routes_and_controllers/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "asianguy69"], ["email", "email@email.com"], ["created_at", "2020-10-28 21:47:54.392479"], ["updated_at", "2020-10-28 21:47:54.392479"]]
---
  def create
    user = User.new(new_params)
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def show
    render json: User.find_by(id: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "walker"], ["updated_at", "2020-10-28 21:56:55.490951"], ["id", 2]]
---
  def update
    user = User.find_by(id: params[:id])
    if user.update(new_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
  def destroy
    user = User.find_by(id: params[:id])
    user.destroy